app/views/wishes/_form.html.haml

    Семестр:
    = f.select :term_id,Term.all.map{|t| [t.name,t.id]}
  .actions
---
SELECT "terms".* FROM "terms"