app/views/students/_form.html.haml

SELECT "groups".* FROM "groups"
---
    Группа:
    = f.select :group_id,Group.all.map{|g| [g.number,g.id]}
  .actions