app/views/chairs/_form.html.haml

SELECT "faculties".* FROM "faculties"
---
    Выбрать факультет:
    = f.select :faculty_id,Faculty.all.map{|fa| [fa.short_name,fa.id]}
  .field