app/views/groups/_form.html.haml

SELECT "faculties".* FROM "faculties"
---
    Факультет:
    = f.select :faculty_id,Faculty.all.map{|fa| [fa.name,fa.id]}
  .actions