app/views/teachers/_form.html.haml

SELECT "chairs".* FROM "chairs"
---
    = f.label :Кафедра
    = f.select :chair_id,Chair.all.map{|c| [c.name,c.id]}
  .actions