app/controllers/chairs_controller.rb

SELECT "chairs".* FROM "chairs"
---
  def index
    @chairs = Chair.all

SELECT "chairs".* FROM "chairs" WHERE "chairs"."id" = 1 LIMIT 1
SELECT "teachers".* FROM "teachers" WHERE ("teachers".chair_id = 1)
---
  def show
    @chair = Chair.includes(:teacher).find(params[:id])

SELECT "chairs".* FROM "chairs" WHERE "chairs"."id" = 4 LIMIT 1
---
  def edit
    @chair = Chair.find(params[:id])

INSERT INTO "chairs" ("updated_at", "number", "faculty_id", "name", "created_at") VALUES ('2012-01-11 16:06:31.078075', 345, 4, 'Информационной безобастности', '2012-01-11 16:06:31.078075')
---
  def create
    @chair = Chair.new(params[:chair])

    respond_to do |format|
      if @chair.save

SELECT "chairs".* FROM "chairs" WHERE "chairs"."id" = 4 LIMIT 1
UPDATE "chairs" SET "updated_at" = '2012-01-11 16:08:37.146455', "number" = 353 WHERE "chairs"."id" = 4
---
  def update
    @chair = Chair.find(params[:id])

    respond_to do |format|
      if @chair.update_attributes(params[:chair])