app/controllers/faculties_controller.rb

  def index
    @faculties = Faculty.all
---
SELECT "faculties".* FROM "faculties"

  def show
    @faculty = Faculty.includes(:chairs).find(params[:id])
---
SELECT "chairs".* FROM "chairs" WHERE ("chairs".faculty_id = 1)
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = 1 LIMIT 1

  def edit
    @faculty = Faculty.find(params[:id])
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = 1 LIMIT 1

  def create
    @faculty = Faculty.new(params[:faculty])

    respond_to do |format|
      if @faculty.save
---
INSERT INTO "faculties" ("short_name", "updated_at", "name", "created_at") VALUES ('ИТ', '2012-01-11 16:05:53.176321', 'Инфорционных технологий', '2012-01-11 16:05:53.176321')

  def update
    @faculty = Faculty.find(params[:id])
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = 1 LIMIT 1

  def destroy
    @faculty = Faculty.find(params[:id])
    @faculty.destroy
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = 1 LIMIT 1
DELETE FROM "faculties" WHERE "faculties"."id" = 1