app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def show
    @group = Group.includes(:students).find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1
SELECT "students".* FROM "students" WHERE ("students".group_id = 1)

  def edit
    @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 4 LIMIT 1

  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("updated_at", "number", "faculty_id", "created_at") VALUES ('2012-01-11 16:14:56.705144', '1263', 1, '2012-01-11 16:14:56.705144')

  def update
    @group = Group.find(params[:id])

    respond_to do |format|
      if @group.update_attributes(params[:group])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 4 LIMIT 1
UPDATE "groups" SET "updated_at" = '2012-01-11 16:15:43.435362', "faculty_id" = 4 WHERE "groups"."id" = 3