app/controllers/students_controller.rb

INSERT INTO "students" ("group_id", "l_name", "created_at", "f_name", "updated_at", "s_name") VALUES (1, 'Арбузова', '2012-01-11 16:16:35.250668', 'Елена', '2012-01-11 16:16:35.250668', 'Вячеславовна')
---
  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save