app/controllers/teachers_controller.rb

  def index
    @teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

  def show
    @teacher = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = 1 LIMIT 1

  def edit
    @teacher = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = 2 LIMIT 1

  def create
    @teacher = Teacher.new(params[:teacher])
#u = User.new(:f_name => @teacher.f_name, :s_name => @teacher.s_name, :l_name => @teacher.l_name, :login => @teacher.login, :password => @teacher.password, :password_confirmation => @teacher.password, :role => 0)
    if @teacher.save
      u = User.new
      u.f_name = @teacher.f_name
      u.s_name = @teacher.s_name
      u.l_name = @teacher.l_name
      u.login = @teacher.login
      u.password = @teacher.password
      u.password_confirmation = @teacher.password
      u.role=0
      u.save
---
INSERT INTO "teachers" ("f_name", "s_name", "l_name", "login", "chair_id", "created_at", "password", "updated_at") VALUES ('андрей', 'Андреевич', 'андреев', 'andrey', NULL, '2012-02-15 12:51:49.942353', '111111', '2012-02-15 12:51:49.942353')
INSERT INTO "users" ("s_name", "role", "remember_token", "f_name", "updated_at", "crypted_password", "created_at", "remember_token_expires_at", "login", "l_name", "salt") VALUES ('вася', 0, NULL, 'вася', '2012-02-15 12:56:28.258070', '32b769c24b3085f41fd11af26360a7971a4807e3', '2012-02-15 12:56:28.258070', NULL, 'vasya13', 'вася', '06d129033230ba47f47ff3019e71e22f826c1893')

  def update
    @teacher = Teacher.find(params[:id])

    respond_to do |format|
      if @teacher.update_attributes(params[:teacher])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = 2 LIMIT 1
UPDATE "teachers" SET "updated_at" = '2012-02-14 16:39:39.710498', "login" = 'poter1' WHERE "teachers"."id" = 2

  def destroy
    @teacher = Teacher.find(params[:id])
    @teacher.destroy
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = 2 LIMIT 1
DELETE FROM "teachers" WHERE "teachers"."id" = 4