app/controllers/terms_controller.rb

  def index
    @terms = Term.all
---
SELECT "terms".* FROM "terms"

  def show
    @term = Term.find(params[:id])
---
SELECT "terms".* FROM "terms" WHERE "terms"."id" = 1 LIMIT 1

  def create
    @term = Term.new(params[:term])

    respond_to do |format|
      if @term.save
---
INSERT INTO "terms" ("short_name", "updated_at", "name", "current", "created_at") VALUES ('вс2012г', '2012-01-11 15:17:52.196335', 'Весенний семестр 2012 года', 't', '2012-01-11 15:17:52.196335')

  def destroy
    @term = Term.find(params[:id])
    @term.destroy
---
SELECT "terms".* FROM "terms" WHERE "terms"."id" = 1 LIMIT 1
DELETE FROM "terms" WHERE "terms"."id" = 1