app/controllers/wishes_controller.rb

  def index
    @wishes = Wish.all
---
SELECT "wishes".* FROM "wishes"

  def show
    @wish = Wish.find(params[:id])
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = 3 LIMIT 1

  def edit
    @wish = Wish.find(params[:id])
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = 3 LIMIT 1

  def create
    @wish = Wish.new(params[:wish])
    @wish.user_id=@current_user.id
    respond_to do |format|
      if @wish.save
---
INSERT INTO "wishes" ("even", "term_id", "user_id", "created_at", "day", "updated_at", "lesson", "week") VALUES (NULL, 1, 1, '2012-02-15 13:18:56.068529', 3, '2012-02-15 13:18:56.068529', 5, NULL)

  def destroy
    @wish = Wish.find(params[:id])
    @wish.destroy
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = 2 LIMIT 1
DELETE FROM "wishes" WHERE "wishes"."id" = 2